# Development Tools
brew "git"                  # version control
brew "git-lfs"              # git large file storage
brew "node"                 # javascript runtime
brew "python"               # python interpreter
brew "rbenv"                # ruby version manager
brew "ruby-build"           # rbenv plugin to build ruby
brew "deno"                 # secure javascript/typescript runtime
brew "opam"                 # ocaml package manager
brew "r"                    # statistical computing language

# Editor & CLI Tools
brew "emacs"                # extensible text editor
brew "gnupg"                # gpg encryption
brew "jq"                   # json processor
brew "wget"                 # file retriever
brew "cmake"                # cross-platform build system

# Media Processing
brew "ffmpeg"               # multimedia framework
brew "imagemagick"          # image manipulation
brew "flac"                 # flac audio codec
brew "lame"                 # mp3 encoder

# Terminal & Productivity
cask "iterm2"               # terminal emulator
cask "rectangle"            # window management
cask "karabiner-elements"   # keyboard customizer
cask "hammerspoon"          # automation tool
cask "appcleaner"           # app uninstaller

# Development Apps
cask "visual-studio-code"   # code editor
cask "docker"               # containerization platform
cask "ollama"               # local llm runner

# Browsers
cask "firefox"              # web browser
cask "google-chrome"        # web browser

# Note-Taking & Communication
cask "obsidian"             # knowledge base
cask "slack"                # team communication

# Media & Entertainment
cask "vlc"                  # media player
cask "spotify"              # music streaming

# Optional (commented out - uncomment to install)
# cask "steam"              # gaming platform
# cask "youtube-downloader" # download youtube videos
